import model.Student;
import services.StudentServices;

import java.util.List;

public class main {
     public static void main(String[] args) {
          System.out.println("Helllo");
          StudentServices services = new StudentServices();
          services.writeToExcelSheet();
          //List<User> userList = servie.ReadDataFromExcel("D:/writeToExcelSheet/user.xlsx");
          //System.out.println("userList........ "  +  userList);     }

     }
}
/**
 * وصف المشروع:
تطوير نظام شامل لإدارة المدرسة يستخدم تقنيات Java المتقدمة. يهدف هذا النظام إلى توفير حل شامل لإدارة جميع جوانب العمل في المدرسة بشكل إلكتروني، مما يسهل على الإدارة والمعلمين والطلاب التفاعل والتواصل بشكل أفضل.

ميزات المشروع:

إدارة المعلمين والطلاب: يتيح النظام للمدرسة إدارة بيانات المعلمين والطلاب، بما في ذلك إضافة، تعديل، وحذف سجلاتهم.

نظام حضور وغياب: يمكن للمعلمين تسجيل الحضور والغياب للطلاب، ويمكن للطلاب عرض سجلات حضورهم وغيابهم.

نظام إدارة الدورات والصفوف الدراسية: يسمح النظام بتخصيص الدورات والصفوف الدراسية وإدارة جداول الفصول والمواد الدراسية المقررة.

نظام تقييم الطلاب والتقارير: يتيح النظام للمعلمين إضافة تقييمات للطلاب وإنشاء تقارير عن أداء الطلاب، وكذلك يمكن للطلاب عرض تقارير أدائهم.

تواصل الطلاب وأولياء الأمور: يتيح النظام تواصلًا فعّالًا بين المعلمين والطلاب وأولياء الأمور من خلال نظام رسائل داخلي وإشعارات.

نظام مكتبة المدرسة: يمكن للمستخدمين إدارة مكتبة المدرسة، بما في ذلك إضافة وحذف الكتب وإدارة عمليات الاستعارة.

تحليلات وإحصائيات: يوفر النظام تقارير وإحصائيات حول أداء الطلاب والمعلمين والفصول الدراسية لمساعدة الإدارة في اتخاذ القرارات الاستراتيجية.

تقنيات البرمجة المتقدمة المستخدمة:

Java Servlets و JSP (JavaServer Pages): لبناء واجهة المستخدم الديناميكية وإدارة طلبات HTTP.

Java Persistence API (JPA): للتفاعل مع قاعدة البيانات وإدارة الكائنات المستمرة.

Spring Framework: لإدارة الحاويات والتكامل مع مكتبات أخرى مثل Spring MVC و Spring Security.

Hibernate: لتسهيل عمليات البحث والحفظ والتحديث في قاعدة البيانات.

HTML/CSS/JavaScript: لتطوير واجهة المستخدم الرسومية وتحسين تفاعل المستخدم.

MySQL أو PostgreSQL: لإنشاء وإدارة قاعدة البيانات.

هذا المشروع الضخم سيكون فرصة رائعة لتطبيق المفاهيم المتقدمة في Java وبناء تطبيق شامل يساهم في تحسين العملية التعليمية في المدرسة.
**/